// هذا الملف يحتوي على إعدادات أداة Vite التي تُستخدم لتشغيل وبناء مشروع الواجهة الأمامية 
// استيراد إضافة التحديث الجديد لـ Tailwind CSS المتوافقة مع أداة Vite
import tailwindcss from '@tailwindcss/vite';

// استيراد إضافة ريأكت الرسمية لتمكين السيرفر من فهم وتشغيل ملفات الـ JSX/TSX بنجاح
import react from '@vitejs/plugin-react';

// استيراد مكتبة مسارات الملفات الافتراضية في Node.js للتعامل مع الروابط والمجلدات
import path from 'path';

// استيراد دالة التهيئة الرئيسية الخاصة بإعدادات أداة تشغيل المشروع Vite
import { defineConfig } from 'vite';

// تصدير الإعدادات لكي يقرأها المشروع تلقائياً عند التشغيل أو البناء (Build)
export default defineConfig(() => {
  return {
    // 1. قسم الإضافات (Plugins): نضع فيه الأدوات التي تدعم بيئة العمل مثل React و Tailwind
    plugins: [react(), tailwindcss()],
    
    // 2. قسم الاختصارات (Resolve Alias)
    resolve: {
      alias: {
        // هذا السطر يتيح لك استخدام الرمز '@' كاختصار للمجلد الرئيسي للمشروع
        // بدلاً من كتابة مسارات معقدة وطويلة مثل (../../../src/components) تكتب فقط (@/src/components)
        '@': path.resolve(__dirname, '.'),
      },
    },
    
    // 3. إعدادات خادم التطوير المحلي (Development Server)
    server: {
      // إعداد التحديث اللحظي للمتصفح (HMR): يقوم بتحديث التعديلات في المتصفح فور حفظ الملف دون إعادة تحميل الصفحة كاملة
      hmr: true,
      
      // إعداد مراقبة الملفات (Watch): يراقب أي تغييرات أو ملفات جديدة تقوم بإنشائها لتضمينها في السيرفر فوراً
      watch: {},
    },
  };
});